//
// Created by fernando on 28/04/2021.
//
#include <stdio.h>
#include <unistd.h>

#include "animacao.h"
#include "Corzinha.h"

#define V(c) FILL VERDE c RESET
#define W(c) FILL CINZA_CLARO c RESET
#define A(c) FILL AZUL c RESET
#define Y(c) FILL AMARELO c RESET
#define P(c) FILL PRETO c RESET
#define R(c) FILL VERMELHO c RESET
#define T(c) SPOTLIGHT "7;" CIANO c RESET
#define S(c) SPOTLIGHT VERMELHO c RESET


void clearScreen()
{
    usleep(1 * 100000);
    fflush(stdout);
    const char *CLEAR_SCREEN_ANSI = "\033[1;1H\033[2J";
    write(STDOUT_FILENO, CLEAR_SCREEN_ANSI, 12);
}

void print(){
    int c= 0;
    while(c++ <= 1) {
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "| V |                                     | V |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T                            |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "| | |                                     | | |\n"
                "| V |- - - - - - - - - - - - - - - - - - -| V |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R                          |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "| | |- - - - - - - - - - - - - - - - - - -| | |\n"
                "| V |                                     | V |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A                        |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "| | |                                     | | |\n"
                "| V |                                     | V |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B                      |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "| | |                                     | | |\n"
                "| V |                                     | V |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B A                    |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "| | |                                     | | |\n"
                "| V |                                     | V |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B A L                  |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "| | |                                     | | |\n"
                "| V |                                     | V |\n"
                "|   |        T R A B A L H                |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "| | |                                     | | |\n"
                "| V |        T R A B A L H O              | V |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "| | |        T R A B A L H O  D           | | |\n"
                "| V |                                     | V |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B A L H O  D E         |   |\n"
                "| | |                                     | | |\n"
                "| V |                                     | V |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B A L H O  D E         |   |\n"
                "|   |                                     |   |\n"
                "| | |                  S                  | | |\n"
                "| V |                                     | V |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B A L H O  D E         |   |\n"
                "|   |                                     |   |\n"
                "|   |                  S O                |   |\n"
                "| | |                                     | | |\n"
                "| V |   B                                 | V |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B A L H O  D E         |   |\n"
                "|   |                                     |   |\n"
                "|   |                  S O                |   |\n"
                "|   |                                     |   |\n"
                "| | |   B Y:                              | | |\n"
                "| V |                                     | V |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B A L H O  D E         |   |\n"
                "|   |                                     |   |\n"
                "|   |                  S O                |   |\n"
                "|   |                                     |   |\n"
                "|   |   B Y:     "R("FERNANDO AZEVEDO")"         |   |\n"
                                                        "| | |                                     | | |\n"
                                                        "| V |            "A("IGOR VAREJÃO")"             | V |\n"
                                                                                            "|   |                                     |   |\n"
                                                                                            "|   |                                     |   |\n"
                                                                                            "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                                                                                            "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B A L H O  D E         |   |\n"
                "|   |                                     |   |\n"
                "|   |                  S O                |   |\n"
                "|   |                                     |   |\n"
                "|   |   B Y:     "R("FERNANDO AZEVEDO")"         |   |\n"
                                                        "|   |                                     |   |\n"
                                                        "| | |            "A("IGOR VAREJÃO")"             | | |\n"
                                                                                            "| V |                                     | V |\n"
                                                                                            "|   |            "Y("LUÍS EDUARDO CÂMARA")"      |   |\n"
                                                                                                                                       "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                                                                                                                                       "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B A L H O  D E         |   |\n"
                "|   |                                     |   |\n"
                "|   |                  S O                |   |\n"
                "|   |                                     |   |\n"
                "|   |   B Y:     "R("FERNANDO AZEVEDO")"         |   |\n"
                                                        "|   |                                     |   |\n"
                                                        "|   |            "A("IGOR VAREJÃO")"             |   |\n"
                                                                                            "| | |                                     | | |\n"
                                                                                            "| V |            "Y("LUÍS EDUARDO CÂMARA")"      | V |\n"
                                                                                                                                       "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                                                                                                                                       "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B A L H O  D E         |   |\n"
                "|   |                                     |   |\n"
                "|   |                  S O                |   |\n"
                "|   |                                     |   |\n"
                "|   |   B Y:     "R("FERNANDO AZEVEDO")"         |   |\n"
                                                        "|   |                                     |   |\n"
                                                        "|   |            "A("IGOR VAREJÃO")"             |   |\n"
                                                                                            "|   |                                     |   |\n"
                                                                                            "| | |            "Y("LUÍS EDUARDO CÂMARA")"      | | |\n"
                                                                                                                                       "| V |- - - - - - - - - - - - - - - - - - -| V |\n"
                                                                                                                                       "|   |                                     |   |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B A L H O  D E         |   |\n"
                "|   |                                     |   |\n"
                "|   |                  S O                |   |\n"
                "|   |                                     |   |\n"
                "|   |   B Y:     "R("FERNANDO AZEVEDO")"         |   |\n"
                                                        "|   |                                     |   |\n"
                                                        "|   |            "A("IGOR VAREJÃO")"             |   |\n"
                                                                                            "|   |                                     |   |\n"
                                                                                            "|   |            "Y("LUÍS EDUARDO CÂMARA")"      |   |\n"
                                                                                                                                       "| | |- - - - - - - - - - - - - - - - - - -| | |\n"
                                                                                                                                       "| V |                                     | V |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B A L H O  D E         |   |\n"
                "|   |                                     |   |\n"
                "|   |                  S O                |   |\n"
                "|   |                                     |   |\n"
                "|   |   B Y:     "R("FERNANDO AZEVEDO")"         |   |\n"
                                                        "|   |                                     |   |\n"
                                                        "|   |            "A("IGOR VAREJÃO")"             |   |\n"
                                                                                            "|   |                                     |   |\n"
                                                                                            "|   |            "Y("LUÍS EDUARDO CÂMARA")"      |   |\n"
                                                                                                                                       "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                                                                                                                                       "| | |                                     | | |\n");
        clearScreen();
        printf(
                "|   |                                     |   |\n"
                "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |                                     |   |\n"
                "|   |        T R A B A L H O  D E         |   |\n"
                "|   |                                     |   |\n"
                "|   |                  S O                |   |\n"
                "|   |                                     |   |\n"
                "|   |   B Y:     "R("FERNANDO AZEVEDO")"         |   |\n"
                                                        "|   |                                     |   |\n"
                                                        "|   |            "A("IGOR VAREJÃO")"             |   |\n"
                                                                                            "|   |                                     |   |\n"
                                                                                            "|   |            "Y("LUÍS EDUARDO CÂMARA")"      |   |\n"
                                                                                                                                       "|   |- - - - - - - - - - - - - - - - - - -|   |\n"
                                                                                                                                       "|   |                                     |   |\n");



    }
}